External APIs/homesendtest.txt

<?xml version="1.0" encoding="ISO-8859-1"?> <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"> <soap:Body xmlns:ns1="http://www.eservglobal.com/homesend/hws/2.0" xmlns:ns2="http://www.eservglobal.com/homesend/types/2.0" xmlns:ns3="http://www.eservglobal.com/homesend/hws/2.1" xmlns:ns4="http://www.eservglobal.com/homesend/types/2.1"> <ns1:remittanceRequest> <ns1:security> <ns2:login>fip2001RTlogin</ns2:login> <ns2:password>fip2001RTlogin</ns2:password> </ns1:security> <ns1:hsTransactionId xmlns:ns3="http://www.w3.org/2001/XMLSchema-instance"ns3:nil="true" /> <ns1:transactionId>20100430-120342-trid_1 </ns1:transactionId> <ns1:sourceUri>tel:+3530000</ns1:sourceUri> <ns1:destinationUri>tel:+2130000</ns1:destinationUri> <ns1:amountInformation> <ns2:currency>GBP</ns2:currency> <ns2:amount>54</ns2:amount> <ns2:grace>5</ns2:grace> <ns2:validity>2</ns2:validity> </ns1:amountInformation> <ns1:payer>RECEIVER</ns1:payer> <ns1:cbsType>EMoneyToEMoneyTransfer</ns1:cbsType> <ns1:routingTag>sendmaxCBS20routingTag </ns1:routingTag> <ns1:reservationRequired>true</ns1:reservationRequired> <ns1:senderInformation> <ns2:name>User's name</ns2:name> <ns2:address>User's Addr</ns2:address> </ns1:senderInformation> <ns3:vendorSpecificFields> <ns4:vsf> <ns4:vendorId>1234</ns4:vendorId> <ns4:fieldId>1</ns4:fieldId> <ns4:value>CODE012345</ns4:value> </ns4:vsf> </ns3:vendorSpecificFields> </ns1:remittanceRequest> </soap:Body> </soap:Envelope>